ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/PeripheralPins.c
/*
 * Copyright (c) 2015-2016, Nuvoton Technology Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "PeripheralPins.h"

//*** ADC ***

const PinMap PinMap_ADC[] = {
    {PA_8, ADC_1_4, (int) SYS_GPA_MFPH_PA8MFP_EADC1_CH4},
    {PA_9, ADC_1_5, (int) SYS_GPA_MFPH_PA9MFP_EADC1_CH5},
    {PA_10, ADC_1_6, (int) SYS_GPA_MFPH_PA10MFP_EADC1_CH6},
    {PA_11, ADC_1_7, (int) SYS_GPA_MFPH_PA11MFP_EADC1_CH7},
    {PB_0, ADC_0_0, SYS_GPB_MFPL_PB0MFP_EADC0_CH0},
    {NU_PINNAME_BIND(PB_0, ADC_0_0), ADC_0_0, SYS_GPB_MFPL_PB0MFP_EADC0_CH0},
    {PB_0, ADC_1_8, SYS_GPB_MFPL_PB0MFP_EADC1_CH8},
    {NU_PINNAME_BIND(PB_0, ADC_1_8), ADC_1_8, SYS_GPB_MFPL_PB0MFP_EADC1_CH8},
    {PB_1, ADC_0_1, SYS_GPB_MFPL_PB1MFP_EADC0_CH1},
    {NU_PINNAME_BIND(PB_1, ADC_0_1), ADC_0_1, SYS_GPB_MFPL_PB1MFP_EADC0_CH1},
    {PB_1, ADC_1_9, SYS_GPB_MFPL_PB1MFP_EADC1_CH9},
    {NU_PINNAME_BIND(PB_1, ADC_1_9), ADC_1_9, SYS_GPB_MFPL_PB1MFP_EADC1_CH9},
    {PB_2, ADC_0_2, SYS_GPB_MFPL_PB2MFP_EADC0_CH2},
    {NU_PINNAME_BIND(PB_2, ADC_0_2), ADC_0_2, SYS_GPB_MFPL_PB2MFP_EADC0_CH2},
    {PB_2, ADC_1_10, SYS_GPB_MFPL_PB2MFP_EADC1_CH10},
    {NU_PINNAME_BIND(PB_2, ADC_1_10), ADC_1_10, SYS_GPB_MFPL_PB2MFP_EADC1_CH10},
    {PB_3, ADC_0_3, SYS_GPB_MFPL_PB3MFP_EADC0_CH3},
    {NU_PINNAME_BIND(PB_3, ADC_0_3), ADC_0_3, SYS_GPB_MFPL_PB3MFP_EADC0_CH3},
    {PB_3, ADC_1_11, SYS_GPB_MFPL_PB3MFP_EADC1_CH11},
    {NU_PINNAME_BIND(PB_3, ADC_1_11), ADC_1_11, SYS_GPB_MFPL_PB3MFP_EADC1_CH11},
    {PB_4, ADC_0_4, SYS_GPB_MFPL_PB4MFP_EADC0_CH4},
    {PB_5, ADC_0_5, SYS_GPB_MFPL_PB5MFP_EADC0_CH5},
    {PB_6, ADC_0_6, SYS_GPB_MFPL_PB6MFP_EADC0_CH6},
    {PB_7, ADC_0_7, SYS_GPB_MFPL_PB7MFP_EADC0_CH7},
    {PB_8, ADC_0_8, (int) SYS_GPB_MFPH_PB8MFP_EADC0_CH8},
    {PB_9, ADC_0_9, (int) SYS_GPB_MFPH_PB9MFP_EADC0_CH9},
    {PB_10, ADC_0_10, (int) SYS_GPB_MFPH_PB10MFP_EADC0_CH10},
    {PB_11, ADC_0_11, (int) SYS_GPB_MFPH_PB11MFP_EADC0_CH11},
    {PB_12, ADC_0_12, (int) SYS_GPB_MFPH_PB12MFP_EADC0_CH12},
    {NU_PINNAME_BIND(PB_12, ADC_0_12), ADC_0_12, SYS_GPB_MFPH_PB12MFP_EADC0_CH12},
    {PB_12, ADC_1_12, (int) SYS_GPB_MFPH_PB12MFP_EADC1_CH12},
    {NU_PINNAME_BIND(PB_12, ADC_1_12), ADC_1_12, SYS_GPB_MFPH_PB12MFP_EADC1_CH12},
    {PB_13, ADC_0_13, (int) SYS_GPB_MFPH_PB13MFP_EADC0_CH13},
    {NU_PINNAME_BIND(PB_13, ADC_0_13), ADC_0_13, SYS_GPB_MFPH_PB13MFP_EADC0_CH13},
    {PB_13, ADC_1_13, (int) SYS_GPB_MFPH_PB13MFP_EADC1_CH13},
    {NU_PINNAME_BIND(PB_13, ADC_1_13), ADC_1_13, SYS_GPB_MFPH_PB13MFP_EADC1_CH13},
    {PB_14, ADC_0_14, (int) SYS_GPB_MFPH_PB14MFP_EADC0_CH14},
    {NU_PINNAME_BIND(PB_14, ADC_0_14), ADC_0_14, SYS_GPB_MFPH_PB14MFP_EADC0_CH14},
    {PB_14, ADC_1_14, (int) SYS_GPB_MFPH_PB14MFP_EADC1_CH14},
    {NU_PINNAME_BIND(PB_14, ADC_1_14), ADC_1_14, SYS_GPB_MFPH_PB14MFP_EADC1_CH14},
    {PB_15, ADC_0_15, (int) SYS_GPB_MFPH_PB15MFP_EADC0_CH15},
    {NU_PINNAME_BIND(PB_15, ADC_0_15), ADC_0_15, SYS_GPB_MFPH_PB15MFP_EADC0_CH15},
    {PB_15, ADC_1_15, (int) SYS_GPB_MFPH_PB15MFP_EADC1_CH15},
    {NU_PINNAME_BIND(PB_15, ADC_1_15), ADC_1_15, SYS_GPB_MFPH_PB15MFP_EADC1_CH15},
    {PC_13, ADC_1_3, (int) SYS_GPC_MFPH_PC13MFP_EADC1_CH3},
    {PD_10, ADC_1_0, (int) SYS_GPD_MFPH_PD10MFP_EADC1_CH0},
    {PD_11, ADC_1_1, (int) SYS_GPD_MFPH_PD11MFP_EADC1_CH1},
    {PD_12, ADC_1_2, (int) SYS_GPD_MFPH_PD12MFP_EADC1_CH2},

    {NC,   NC,    0}
};

//*** DAC ***

const PinMap PinMap_DAC[] = {
    {PB_12, DAC_0_0, (int) SYS_GPB_MFPH_PB12MFP_DAC0_OUT},
    {PB_13, DAC_1_0, (int) SYS_GPB_MFPH_PB13MFP_DAC1_OUT},

    {NC,   NC,    0}
};

//*** I2C ***

const PinMap PinMap_I2C_SDA[] = {
    {PA_0, I2C_2, SYS_GPA_MFPL_PA0MFP_I2C2_SDA},
    {PA_2, I2C_1, SYS_GPA_MFPL_PA2MFP_I2C1_SDA},
    {PA_4, I2C_0, SYS_GPA_MFPL_PA4MFP_I2C0_SDA},
    {PA_6, I2C_1, SYS_GPA_MFPL_PA6MFP_I2C1_SDA},
    {PA_10, I2C_2, (int) SYS_GPA_MFPH_PA10MFP_I2C2_SDA},
    {PA_13, I2C_1, (int) SYS_GPA_MFPH_PA13MFP_I2C1_SDA},
    {PA_15, I2C_2, (int) SYS_GPA_MFPH_PA15MFP_I2C2_SDA},
    {PB_0, I2C_1, SYS_GPB_MFPL_PB0MFP_I2C1_SDA},
#if COMPONENT_FPGA_CI_TEST_SHIELD && !TARGET_NUMAKER_PFM_M487 && !TARGET_NUMAKER_IOT_M487
    /* Only available in M480 LG. Currently, we don't strictly distinguish pinmap among parts and
     * just make necessary modifications to pass FPGA CI Test Shield tests. */
    {PB_2, I2C_1, SYS_GPB_MFPL_PB2MFP_I2C1_SDA},
#endif
    {PB_4, I2C_0, SYS_GPB_MFPL_PB4MFP_I2C0_SDA},
    {PB_8, I2C_0, (int) SYS_GPB_MFPH_PB8MFP_I2C0_SDA},
    {PB_10, I2C_1, (int) SYS_GPB_MFPH_PB10MFP_I2C1_SDA},
    {PB_12, I2C_2, (int) SYS_GPB_MFPH_PB12MFP_I2C2_SDA},
    {PC_0, I2C_0, SYS_GPC_MFPL_PC0MFP_I2C0_SDA},
    {PC_4, I2C_1, SYS_GPC_MFPL_PC4MFP_I2C1_SDA},
    {PC_8, I2C_0, (int) SYS_GPC_MFPH_PC8MFP_I2C0_SDA},
    {PC_11, I2C_0, (int) SYS_GPC_MFPH_PC11MFP_I2C0_SDA},
    {PD_0, I2C_2, SYS_GPD_MFPL_PD0MFP_I2C2_SDA},
    {PD_4, I2C_1, SYS_GPD_MFPL_PD4MFP_I2C1_SDA},
    {PD_6, I2C_0, SYS_GPD_MFPL_PD6MFP_I2C0_SDA},
    {PD_8, I2C_2, (int) SYS_GPD_MFPH_PD8MFP_I2C2_SDA},
    {PE_0, I2C_1, SYS_GPE_MFPL_PE0MFP_I2C1_SDA},
    {PF_1, I2C_1, SYS_GPF_MFPL_PF1MFP_I2C1_SDA},
    {PF_2, I2C_0, SYS_GPF_MFPL_PF2MFP_I2C0_SDA},
    {PG_1, I2C_0, SYS_GPG_MFPL_PG1MFP_I2C0_SDA},
    {PG_3, I2C_1, SYS_GPG_MFPL_PG3MFP_I2C1_SDA},
    {PH_3, I2C_0, SYS_GPH_MFPL_PH3MFP_I2C0_SDA},
    {PH_9, I2C_2, (int) SYS_GPH_MFPH_PH9MFP_I2C2_SDA},

    {NC,    NC,    0}
};

const PinMap PinMap_I2C_SCL[] = {
    {PA_1, I2C_2, SYS_GPA_MFPL_PA1MFP_I2C2_SCL},
    {PA_3, I2C_1, SYS_GPA_MFPL_PA3MFP_I2C1_SCL},
    {PA_5, I2C_0, SYS_GPA_MFPL_PA5MFP_I2C0_SCL},
    {PA_7, I2C_1, SYS_GPA_MFPL_PA7MFP_I2C1_SCL},
    {PA_11, I2C_2, (int) SYS_GPA_MFPH_PA11MFP_I2C2_SCL},
    {PA_12, I2C_1, (int) SYS_GPA_MFPH_PA12MFP_I2C1_SCL},
    {PA_14, I2C_2, (int) SYS_GPA_MFPH_PA14MFP_I2C2_SCL},
    {PB_1, I2C_1, SYS_GPB_MFPL_PB1MFP_I2C1_SCL},
    {PB_3, I2C_1, SYS_GPB_MFPL_PB3MFP_I2C1_SCL},
    {PB_5, I2C_0, SYS_GPB_MFPL_PB5MFP_I2C0_SCL},
    {PB_9, I2C_0, (int) SYS_GPB_MFPH_PB9MFP_I2C0_SCL},
    {PB_11, I2C_1, (int) SYS_GPB_MFPH_PB11MFP_I2C1_SCL},
    {PB_13, I2C_2, (int) SYS_GPB_MFPH_PB13MFP_I2C2_SCL},
    {PC_1, I2C_0, SYS_GPC_MFPL_PC1MFP_I2C0_SCL},
    {PC_5, I2C_1, SYS_GPC_MFPL_PC5MFP_I2C1_SCL},
    {PC_12, I2C_0, (int) SYS_GPC_MFPH_PC12MFP_I2C0_SCL},
    {PD_1, I2C_2, SYS_GPD_MFPL_PD1MFP_I2C2_SCL},
    {PD_5, I2C_1, SYS_GPD_MFPL_PD5MFP_I2C1_SCL},
    {PD_7, I2C_0, SYS_GPD_MFPL_PD7MFP_I2C0_SCL},
    {PD_9, I2C_2, (int) SYS_GPD_MFPH_PD9MFP_I2C2_SCL},
    {PE_1, I2C_1, SYS_GPE_MFPL_PE1MFP_I2C1_SCL},
    {PE_13, I2C_0, (int) SYS_GPE_MFPH_PE13MFP_I2C0_SCL},
    {PF_0, I2C_1, SYS_GPF_MFPL_PF0MFP_I2C1_SCL},
    {PF_3, I2C_0, SYS_GPF_MFPL_PF3MFP_I2C0_SCL},
    {PG_0, I2C_0, SYS_GPG_MFPL_PG0MFP_I2C0_SCL},
    {PG_2, I2C_1, SYS_GPG_MFPL_PG2MFP_I2C1_SCL},
    {PH_2, I2C_0, SYS_GPH_MFPL_PH2MFP_I2C0_SCL},
    {PH_8, I2C_2, (int) SYS_GPH_MFPH_PH8MFP_I2C2_SCL},

    {NC,    NC,    0}
};

