ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/PeripheralPins.c
//*** PWM ***

const PinMap PinMap_PWM[] = {
    {PA_0, PWM_0_5, SYS_GPA_MFPL_PA0MFP_EPWM0_CH5},
    {PA_1, PWM_0_4, SYS_GPA_MFPL_PA1MFP_EPWM0_CH4},
    {PA_2, PWM_0_3, SYS_GPA_MFPL_PA2MFP_EPWM0_CH3},
    {PA_3, PWM_0_2, SYS_GPA_MFPL_PA3MFP_EPWM0_CH2},
    {PA_4, PWM_0_1, SYS_GPA_MFPL_PA4MFP_EPWM0_CH1},
    {PA_5, PWM_0_0, SYS_GPA_MFPL_PA5MFP_EPWM0_CH0},
    {PA_6, PWM_1_5, SYS_GPA_MFPL_PA6MFP_EPWM1_CH5},
    {PA_7, PWM_1_4, SYS_GPA_MFPL_PA7MFP_EPWM1_CH4},
    {PB_0, PWM_0_5, SYS_GPB_MFPL_PB0MFP_EPWM0_CH5},
    {NU_PINNAME_BIND(PB_0, PWM_0_5), PWM_0_5, SYS_GPB_MFPL_PB0MFP_EPWM0_CH5},
    {PB_0, PWM_1_5, SYS_GPB_MFPL_PB0MFP_EPWM1_CH5},
    {NU_PINNAME_BIND(PB_0, PWM_1_5), PWM_1_5, SYS_GPB_MFPL_PB0MFP_EPWM1_CH5},
    {PB_1, PWM_0_4, SYS_GPB_MFPL_PB1MFP_EPWM0_CH4},
    {NU_PINNAME_BIND(PB_1, PWM_0_4), PWM_0_4, SYS_GPB_MFPL_PB1MFP_EPWM0_CH4},
    {PB_1, PWM_1_4, SYS_GPB_MFPL_PB1MFP_EPWM1_CH4},
    {NU_PINNAME_BIND(PB_1, PWM_1_4), PWM_1_4, SYS_GPB_MFPL_PB1MFP_EPWM1_CH4},
    {PB_2, PWM_0_3, SYS_GPB_MFPL_PB2MFP_EPWM0_CH3},
    {PB_3, PWM_0_2, SYS_GPB_MFPL_PB3MFP_EPWM0_CH2},
    {PB_4, PWM_0_1, SYS_GPB_MFPL_PB4MFP_EPWM0_CH1},
    {PB_5, PWM_0_0, SYS_GPB_MFPL_PB5MFP_EPWM0_CH0},
    {PB_6, PWM_1_5, SYS_GPB_MFPL_PB6MFP_EPWM1_CH5},
    {PB_7, PWM_1_4, SYS_GPB_MFPL_PB7MFP_EPWM1_CH4},
    {PB_12, PWM_1_3, (int) SYS_GPB_MFPH_PB12MFP_EPWM1_CH3},
    {PB_13, PWM_1_2, (int) SYS_GPB_MFPH_PB13MFP_EPWM1_CH2},
    {PB_14, PWM_1_1, (int) SYS_GPB_MFPH_PB14MFP_EPWM1_CH1},
    {PB_15, PWM_1_0, (int) SYS_GPB_MFPH_PB15MFP_EPWM1_CH0},
    {PC_0, PWM_1_5, SYS_GPC_MFPL_PC0MFP_EPWM1_CH5},
    {PC_1, PWM_1_4, SYS_GPC_MFPL_PC1MFP_EPWM1_CH4},
    {PC_2, PWM_1_3, SYS_GPC_MFPL_PC2MFP_EPWM1_CH3},
    {PC_3, PWM_1_2, SYS_GPC_MFPL_PC3MFP_EPWM1_CH2},
    {PC_4, PWM_1_1, SYS_GPC_MFPL_PC4MFP_EPWM1_CH1},
    {PC_5, PWM_1_0, SYS_GPC_MFPL_PC5MFP_EPWM1_CH0},
    {PC_6, PWM_1_3, SYS_GPC_MFPL_PC6MFP_EPWM1_CH3},
    {PC_7, PWM_1_2, SYS_GPC_MFPL_PC7MFP_EPWM1_CH2},
    {PC_8, PWM_1_1, (int) SYS_GPC_MFPH_PC8MFP_EPWM1_CH1},
    {PC_9, PWM_1_3, (int) SYS_GPC_MFPH_PC9MFP_EPWM1_CH3},
    {PC_10, PWM_1_2, (int) SYS_GPC_MFPH_PC10MFP_EPWM1_CH2},
    {PC_11, PWM_1_1, (int) SYS_GPC_MFPH_PC11MFP_EPWM1_CH1},
    {PC_12, PWM_1_0, (int) SYS_GPC_MFPH_PC12MFP_EPWM1_CH0},
    {PD_14, PWM_0_4, (int) SYS_GPD_MFPH_PD14MFP_EPWM0_CH4},
    {PE_2, PWM_0_5, SYS_GPE_MFPL_PE2MFP_EPWM0_CH5},
    {PE_3, PWM_0_4, SYS_GPE_MFPL_PE3MFP_EPWM0_CH4},
    {PE_4, PWM_0_3, SYS_GPE_MFPL_PE4MFP_EPWM0_CH3},
    {PE_5, PWM_0_2, SYS_GPE_MFPL_PE5MFP_EPWM0_CH2},
    {PE_6, PWM_0_1, SYS_GPE_MFPL_PE6MFP_EPWM0_CH1},
    {PE_7, PWM_0_0, SYS_GPE_MFPL_PE7MFP_EPWM0_CH0},
    {PE_8, PWM_0_0, (int) SYS_GPE_MFPH_PE8MFP_EPWM0_CH0},
    {PE_9, PWM_0_1, (int) SYS_GPE_MFPH_PE9MFP_EPWM0_CH1},
    {PE_10, PWM_0_2, (int) SYS_GPE_MFPH_PE10MFP_EPWM0_CH2},
    {PE_11, PWM_0_3, (int) SYS_GPE_MFPH_PE11MFP_EPWM0_CH3},
    {PE_12, PWM_0_4, (int) SYS_GPE_MFPH_PE12MFP_EPWM0_CH4},
    {PE_13, PWM_0_5, (int) SYS_GPE_MFPH_PE13MFP_EPWM0_CH5},
    {NU_PINNAME_BIND(PE_13, PWM_0_5), PWM_0_5, (int) SYS_GPE_MFPH_PE13MFP_EPWM0_CH5},
    {PE_13, PWM_1_0, SYS_GPE_MFPH_PE13MFP_EPWM1_CH0},
    {NU_PINNAME_BIND(PE_13, PWM_1_0), PWM_1_0, (int) SYS_GPE_MFPH_PE13MFP_EPWM1_CH0},
    {PF_5, PWM_0_0, SYS_GPF_MFPL_PF5MFP_EPWM0_CH0},
    {PG_5, PWM_0_3, SYS_GPG_MFPL_PG5MFP_EPWM0_CH3},
    {PG_6, PWM_0_2, SYS_GPG_MFPL_PG6MFP_EPWM0_CH2},
    {PG_7, PWM_0_1, SYS_GPG_MFPL_PG7MFP_EPWM0_CH1},
    {PG_8, PWM_0_0, (int) SYS_GPG_MFPH_PG8MFP_EPWM0_CH0},
    {PH_11, PWM_0_5, (int) SYS_GPH_MFPH_PH11MFP_EPWM0_CH5},

    {NC,    NC,    0}
};

//*** SERIAL ***

const PinMap PinMap_UART_TX[] = {
    {PA_1, UART_0, SYS_GPA_MFPL_PA1MFP_UART0_TXD},
    {PA_3, UART_1, SYS_GPA_MFPL_PA3MFP_UART1_TXD},
    {NU_PINNAME_BIND(PA_3, UART_1), UART_1, SYS_GPA_MFPL_PA3MFP_UART1_TXD},
    {PA_3, UART_4, SYS_GPA_MFPL_PA3MFP_UART4_TXD},
    {NU_PINNAME_BIND(PA_3, UART_4), UART_4, SYS_GPA_MFPL_PA3MFP_UART4_TXD},
    {PA_5, UART_5, SYS_GPA_MFPL_PA5MFP_UART5_TXD},
    {PA_7, UART_0, SYS_GPA_MFPL_PA7MFP_UART0_TXD},
    {PA_9, UART_1, (int) SYS_GPA_MFPH_PA9MFP_UART1_TXD},
    {NU_PINNAME_BIND(PA_9, UART_1), UART_1, SYS_GPA_MFPH_PA9MFP_UART1_TXD},
    {PA_9, UART_7, (int) SYS_GPA_MFPH_PA9MFP_UART7_TXD},
    {NU_PINNAME_BIND(PA_9, UART_7), UART_7, SYS_GPA_MFPH_PA9MFP_UART7_TXD},
    {PA_11, UART_6, (int) SYS_GPA_MFPH_PA11MFP_UART6_TXD},
    {PA_12, UART_4, (int) SYS_GPA_MFPH_PA12MFP_UART4_TXD},
    {PA_14, UART_0, (int) SYS_GPA_MFPH_PA14MFP_UART0_TXD},
    {PB_1, UART_2, SYS_GPB_MFPL_PB1MFP_UART2_TXD},
    {PB_3, UART_1, SYS_GPB_MFPL_PB3MFP_UART1_TXD},
    {PB_5, UART_2, SYS_GPB_MFPL_PB5MFP_UART2_TXD},
    {NU_PINNAME_BIND(PB_5, UART_2), UART_2, SYS_GPB_MFPL_PB5MFP_UART2_TXD},
    {PB_5, UART_5, SYS_GPB_MFPL_PB5MFP_UART5_TXD},
    {NU_PINNAME_BIND(PB_5, UART_5), UART_5, SYS_GPB_MFPL_PB5MFP_UART5_TXD},
    {PB_7, UART_1, SYS_GPB_MFPL_PB7MFP_UART1_TXD},
    {PB_9, UART_0, (int) SYS_GPB_MFPH_PB9MFP_UART0_TXD},
    {NU_PINNAME_BIND(PB_9, UART_0), UART_0, SYS_GPB_MFPH_PB9MFP_UART0_TXD},
    {PB_9, UART_7, (int) SYS_GPB_MFPH_PB9MFP_UART7_TXD},
    {NU_PINNAME_BIND(PB_9, UART_7), UART_7, SYS_GPB_MFPH_PB9MFP_UART7_TXD},
    {PB_11, UART_4, (int) SYS_GPB_MFPH_PB11MFP_UART4_TXD},
    {PB_13, UART_0, (int) SYS_GPB_MFPH_PB13MFP_UART0_TXD},
    {PB_15, UART_3, (int) SYS_GPB_MFPH_PB15MFP_UART3_TXD},
    {PC_1, UART_2, SYS_GPC_MFPL_PC1MFP_UART2_TXD},
    {PC_3, UART_3, SYS_GPC_MFPL_PC3MFP_UART3_TXD},
    {PC_5, UART_2, SYS_GPC_MFPL_PC5MFP_UART2_TXD},
    {NU_PINNAME_BIND(PC_5, UART_2), UART_2, SYS_GPC_MFPL_PC5MFP_UART2_TXD},
    {PC_5, UART_4, SYS_GPC_MFPL_PC5MFP_UART4_TXD},
    {NU_PINNAME_BIND(PC_5, UART_4), UART_4, SYS_GPC_MFPL_PC5MFP_UART4_TXD},
    {PC_7, UART_4, SYS_GPC_MFPL_PC7MFP_UART4_TXD},
    {NU_PINNAME_BIND(PC_7, UART_4), UART_4, SYS_GPC_MFPL_PC7MFP_UART4_TXD},
    {PC_7, UART_6, SYS_GPC_MFPL_PC7MFP_UART6_TXD},
    {NU_PINNAME_BIND(PC_7, UART_6), UART_6, SYS_GPC_MFPL_PC7MFP_UART6_TXD},
    {PC_10, UART_3, (int) SYS_GPC_MFPH_PC10MFP_UART3_TXD},
    {PC_12, UART_0, (int) SYS_GPC_MFPH_PC12MFP_UART0_TXD},
    {NU_PINNAME_BIND(PC_12, UART_0), UART_0, SYS_GPC_MFPH_PC12MFP_UART0_TXD},
    {PC_12, UART_6, (int) SYS_GPC_MFPH_PC12MFP_UART6_TXD},
    {NU_PINNAME_BIND(PC_12, UART_6), UART_6, SYS_GPC_MFPH_PC12MFP_UART6_TXD},
    {PC_13, UART_2, (int) SYS_GPC_MFPH_PC13MFP_UART2_TXD},
    {PD_1, UART_3, SYS_GPD_MFPL_PD1MFP_UART3_TXD},
    {PD_3, UART_0, SYS_GPD_MFPL_PD3MFP_UART0_TXD},
    {PD_7, UART_1, SYS_GPD_MFPL_PD7MFP_UART1_TXD},
    {PD_9, UART_7, (int) SYS_GPD_MFPH_PD9MFP_UART7_TXD},
    {PD_11, UART_1, (int) SYS_GPD_MFPH_PD11MFP_UART1_TXD},
    {PE_1, UART_3, SYS_GPE_MFPL_PE1MFP_UART3_TXD},
    {PE_3, UART_7, SYS_GPE_MFPL_PE3MFP_UART7_TXD},
    {PE_5, UART_6, SYS_GPE_MFPL_PE5MFP_UART6_TXD},
    {PE_7, UART_5, (int) SYS_GPE_MFPL_PE7MFP_UART5_TXD},
    {PE_8, UART_2, (int) SYS_GPE_MFPH_PE8MFP_UART2_TXD},
    {PE_10, UART_3, (int) SYS_GPE_MFPH_PE10MFP_UART3_TXD},
    {PE_13, UART_1, (int) SYS_GPE_MFPH_PE13MFP_UART1_TXD},
    {PE_14, UART_2, (int) SYS_GPE_MFPH_PE14MFP_UART2_TXD},
    {NU_PINNAME_BIND(PE_14, UART_2), UART_2, SYS_GPE_MFPH_PE14MFP_UART2_TXD},
    {PE_14, UART_6, (int) SYS_GPE_MFPH_PE14MFP_UART6_TXD},
    {NU_PINNAME_BIND(PE_14, UART_6), UART_6, SYS_GPE_MFPH_PE14MFP_UART6_TXD},
    {PF_0, UART_0, SYS_GPF_MFPL_PF0MFP_UART0_TXD},
    {NU_PINNAME_BIND(PF_0, UART_0), UART_0, SYS_GPF_MFPL_PF0MFP_UART0_TXD},
    {PF_0, UART_1, SYS_GPF_MFPL_PF0MFP_UART1_TXD},
    {NU_PINNAME_BIND(PF_0, UART_1), UART_1, SYS_GPF_MFPL_PF0MFP_UART1_TXD},
    {PF_3, UART_0, SYS_GPF_MFPL_PF3MFP_UART0_TXD},
    {PF_4, UART_2, SYS_GPF_MFPL_PF4MFP_UART2_TXD},
    {PF_7, UART_4, SYS_GPF_MFPL_PF7MFP_UART4_TXD},
    {PF_11, UART_5, (int) SYS_GPF_MFPH_PF11MFP_UART5_TXD},
    {PG_0, UART_1, SYS_GPG_MFPL_PG0MFP_UART1_TXD},
    {PG_1, UART_2, SYS_GPG_MFPL_PG1MFP_UART2_TXD},
    {PG_11, UART_7, (int) SYS_GPG_MFPH_PG11MFP_UART7_TXD},
    {PG_13, UART_6, (int) SYS_GPG_MFPH_PG13MFP_UART6_TXD},
    {PH_0, UART_5, SYS_GPH_MFPL_PH0MFP_UART5_TXD},
    {PH_2, UART_4, SYS_GPH_MFPL_PH2MFP_UART4_TXD},
    {PH_4, UART_6, SYS_GPH_MFPL_PH4MFP_UART6_TXD},
    {PH_6, UART_7, SYS_GPH_MFPL_PH6MFP_UART7_TXD},
    {PH_8, UART_1, (int) SYS_GPH_MFPH_PH8MFP_UART1_TXD},
    {PH_10, UART_0, (int) SYS_GPH_MFPH_PH10MFP_UART0_TXD},
    {NU_PINNAME_BIND(PH_10, UART_0), UART_0, (int) SYS_GPH_MFPH_PH10MFP_UART0_TXD},
    {PH_10, UART_4, (int) SYS_GPH_MFPH_PH10MFP_UART4_TXD},
    {NU_PINNAME_BIND(PH_10, UART_4), UART_4, (int) SYS_GPH_MFPH_PH10MFP_UART4_TXD},

    {NC,    NC,     0}
};

const PinMap PinMap_UART_RX[] = {
    {PA_0, UART_0, SYS_GPA_MFPL_PA0MFP_UART0_RXD},
    {PA_2, UART_1, SYS_GPA_MFPL_PA2MFP_UART1_RXD},
    {NU_PINNAME_BIND(PA_2, UART_1), UART_1, SYS_GPA_MFPL_PA2MFP_UART1_RXD},
    {PA_2, UART_4, SYS_GPA_MFPL_PA2MFP_UART4_RXD},
    {NU_PINNAME_BIND(PA_2, UART_4), UART_4, SYS_GPA_MFPL_PA2MFP_UART4_RXD},
    {PA_4, UART_5, SYS_GPA_MFPL_PA4MFP_UART5_RXD},
    {PA_6, UART_0, SYS_GPA_MFPL_PA6MFP_UART0_RXD},
    {PA_8, UART_1, (int) SYS_GPA_MFPH_PA8MFP_UART1_RXD},
    {NU_PINNAME_BIND(PA_8, UART_1), UART_1, SYS_GPA_MFPH_PA8MFP_UART1_RXD},
    {PA_8, UART_7, (int) SYS_GPA_MFPH_PA8MFP_UART7_RXD},
    {NU_PINNAME_BIND(PA_8, UART_7), UART_7, SYS_GPA_MFPH_PA8MFP_UART7_RXD},
    {PA_10, UART_6, (int) SYS_GPA_MFPH_PA10MFP_UART6_RXD},
    {PA_13, UART_4, (int) SYS_GPA_MFPH_PA13MFP_UART4_RXD},
    {PA_15, UART_0, (int) SYS_GPA_MFPH_PA15MFP_UART0_RXD},
    {PB_0, UART_2, SYS_GPB_MFPL_PB0MFP_UART2_RXD},
    {PB_2, UART_1, SYS_GPB_MFPL_PB2MFP_UART1_RXD},
    {PB_4, UART_2, SYS_GPB_MFPL_PB4MFP_UART2_RXD},
    {NU_PINNAME_BIND(PB_4, UART_2), UART_2, SYS_GPB_MFPL_PB4MFP_UART2_RXD},
    {PB_4, UART_5, SYS_GPB_MFPL_PB4MFP_UART5_RXD},
    {NU_PINNAME_BIND(PB_4, UART_5), UART_5, SYS_GPB_MFPL_PB4MFP_UART5_RXD},
    {PB_6, UART_1, SYS_GPB_MFPL_PB6MFP_UART1_RXD},
    {PB_8, UART_0, (int) SYS_GPB_MFPH_PB8MFP_UART0_RXD},
    {NU_PINNAME_BIND(PB_8, UART_0), UART_0, (int) SYS_GPB_MFPH_PB8MFP_UART0_RXD},
    {PB_8, UART_7, (int) SYS_GPB_MFPH_PB8MFP_UART7_RXD},
    {NU_PINNAME_BIND(PB_8, UART_7), UART_7, (int) SYS_GPB_MFPH_PB8MFP_UART7_RXD},
    {PB_10, UART_4, (int) SYS_GPB_MFPH_PB10MFP_UART4_RXD},
    {PB_12, UART_0, (int) SYS_GPB_MFPH_PB12MFP_UART0_RXD},
    {PB_14, UART_3, (int) SYS_GPB_MFPH_PB14MFP_UART3_RXD},
    {PC_0, UART_2, SYS_GPC_MFPL_PC0MFP_UART2_RXD},
    {PC_2, UART_3, SYS_GPC_MFPL_PC2MFP_UART3_RXD},
    {PC_4, UART_2, SYS_GPC_MFPL_PC4MFP_UART2_RXD},
    {NU_PINNAME_BIND(PC_4, UART_2), UART_2, SYS_GPC_MFPL_PC4MFP_UART2_RXD},
    {PC_4, UART_4, SYS_GPC_MFPL_PC4MFP_UART4_RXD},
    {NU_PINNAME_BIND(PC_4, UART_4), UART_4, SYS_GPC_MFPL_PC4MFP_UART4_RXD},
    {PC_6, UART_4, SYS_GPC_MFPL_PC6MFP_UART4_RXD},
    {PC_6, UART_6, SYS_GPC_MFPL_PC6MFP_UART6_RXD},
    {PC_8, UART_1, (int) SYS_GPC_MFPH_PC8MFP_UART1_RXD},
    {PC_9, UART_3, (int) SYS_GPC_MFPH_PC9MFP_UART3_RXD},
#if COMPONENT_FPGA_CI_TEST_SHIELD && (TARGET_NUMAKER_PFM_M487 || TARGET_NUMAKER_IOT_M487)
    /* Swap the sequence to pass FPGA CI Test Shield tests */
    {PC_11, UART_6, (int) SYS_GPC_MFPH_PC11MFP_UART6_RXD},
    {NU_PINNAME_BIND(PC_11, UART_6), UART_6, (int) SYS_GPC_MFPH_PC11MFP_UART6_RXD},
    {PC_11, UART_0, (int) SYS_GPC_MFPH_PC11MFP_UART0_RXD},
    {NU_PINNAME_BIND(PC_11, UART_0), UART_0, (int) SYS_GPC_MFPH_PC11MFP_UART0_RXD},
#else
    {PC_11, UART_0, (int) SYS_GPC_MFPH_PC11MFP_UART0_RXD},
    {NU_PINNAME_BIND(PC_11, UART_0), UART_0, (int) SYS_GPC_MFPH_PC11MFP_UART0_RXD},
    {PC_11, UART_6, (int) SYS_GPC_MFPH_PC11MFP_UART6_RXD},
    {NU_PINNAME_BIND(PC_11, UART_6), UART_6, (int) SYS_GPC_MFPH_PC11MFP_UART6_RXD},
#endif
    {PD_0, UART_3, SYS_GPD_MFPL_PD0MFP_UART3_RXD},
    {PD_2, UART_0, SYS_GPD_MFPL_PD2MFP_UART0_RXD},
    {PD_6, UART_1, SYS_GPD_MFPL_PD6MFP_UART1_RXD},
    {PD_8, UART_7, (int) SYS_GPD_MFPH_PD8MFP_UART7_RXD},
    {PD_10, UART_1, (int) SYS_GPD_MFPH_PD10MFP_UART1_RXD},
    {PD_12, UART_2, (int) SYS_GPD_MFPH_PD12MFP_UART2_RXD},
    {PE_0, UART_3, SYS_GPE_MFPL_PE0MFP_UART3_RXD},
    {PE_2, UART_7, SYS_GPE_MFPL_PE2MFP_UART7_RXD},
    {PE_4, UART_6, SYS_GPE_MFPL_PE4MFP_UART6_RXD},
    {PE_6, UART_5, SYS_GPE_MFPL_PE6MFP_UART5_RXD},
    {PE_9, UART_2, (int) SYS_GPE_MFPH_PE9MFP_UART2_RXD},
    {PE_11, UART_3, (int) SYS_GPE_MFPH_PE11MFP_UART3_RXD},
    {PE_15, UART_2, (int) SYS_GPE_MFPH_PE15MFP_UART2_RXD},
    {NU_PINNAME_BIND(PE_15, UART_2), UART_2, (int) SYS_GPE_MFPH_PE15MFP_UART2_RXD},
    {PE_15, UART_6, (int) SYS_GPE_MFPH_PE15MFP_UART6_RXD},
    {NU_PINNAME_BIND(PE_15, UART_6), UART_6, (int) SYS_GPE_MFPH_PE15MFP_UART6_RXD},
    {PF_1, UART_0, SYS_GPF_MFPL_PF1MFP_UART0_RXD},
    {PF_1, UART_1, SYS_GPF_MFPL_PF1MFP_UART1_RXD},
    {PF_2, UART_0, SYS_GPF_MFPL_PF2MFP_UART0_RXD},
    {PF_5, UART_2, SYS_GPF_MFPL_PF5MFP_UART2_RXD},
    {PF_6, UART_4, SYS_GPF_MFPL_PF6MFP_UART4_RXD},
    {PF_10, UART_5, (int) SYS_GPF_MFPH_PF10MFP_UART5_RXD},
    {PG_0, UART_2, SYS_GPG_MFPL_PG0MFP_UART2_RXD},
    {PG_1, UART_1, SYS_GPG_MFPL_PG1MFP_UART1_RXD},
    {PG_12, UART_7, (int) SYS_GPG_MFPH_PG12MFP_UART7_RXD},
    {PG_14, UART_6, (int) SYS_GPG_MFPH_PG14MFP_UART6_RXD},
    {PH_1, UART_5, SYS_GPH_MFPL_PH1MFP_UART5_RXD},
    {PH_3, UART_4, SYS_GPH_MFPL_PH3MFP_UART4_RXD},
    {PH_5, UART_6, SYS_GPH_MFPL_PH5MFP_UART6_RXD},
    {PH_7, UART_7, SYS_GPH_MFPL_PH7MFP_UART7_RXD},
    {PH_9, UART_1, (int) SYS_GPH_MFPH_PH9MFP_UART1_RXD},
    {PH_11, UART_0, (int) SYS_GPH_MFPH_PH11MFP_UART0_RXD},
    {NU_PINNAME_BIND(PH_11, UART_0), UART_0, (int) SYS_GPH_MFPH_PH11MFP_UART0_RXD},
    {PH_11, UART_4, (int) SYS_GPH_MFPH_PH11MFP_UART4_RXD},
    {NU_PINNAME_BIND(PH_11, UART_4), UART_4, (int) SYS_GPH_MFPH_PH11MFP_UART4_RXD},

    {NC,    NC,     0}
};

