ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/PeripheralPins.c
const PinMap PinMap_SPI_SCLK[] = {
    {PA_2, SPI_4, SYS_GPA_MFPL_PA2MFP_QSPI0_CLK},
    {NU_PINNAME_BIND(PA_2, SPI_4), SPI_4, SYS_GPA_MFPL_PA2MFP_QSPI0_CLK},
    {PA_2, SPI_0, SYS_GPA_MFPL_PA2MFP_SPI0_CLK},
    {NU_PINNAME_BIND(PA_2, SPI_0), SPI_0, SYS_GPA_MFPL_PA2MFP_SPI0_CLK},
    {PA_7, SPI_1, SYS_GPA_MFPL_PA7MFP_SPI1_CLK},
    {PA_10, SPI_2, (int) SYS_GPA_MFPH_PA10MFP_SPI2_CLK},
    {PA_13, SPI_2, (int) SYS_GPA_MFPH_PA13MFP_SPI2_CLK},
    {PB_3, SPI_1, SYS_GPB_MFPL_PB3MFP_SPI1_CLK},
    {PB_11, SPI_3, (int) SYS_GPB_MFPH_PB11MFP_SPI3_CLK},
    {PB_14, SPI_0, (int) SYS_GPB_MFPH_PB14MFP_SPI0_CLK},
    {PC_1, SPI_1, SYS_GPC_MFPL_PC1MFP_SPI1_CLK},
    {PC_2, SPI_4, SYS_GPC_MFPL_PC2MFP_QSPI0_CLK},
    {PC_4, SPI_5, SYS_GPC_MFPL_PC4MFP_QSPI1_CLK},
    {PC_10, SPI_3, (int) SYS_GPC_MFPH_PC10MFP_SPI3_CLK},
    {PC_14, SPI_4, (int) SYS_GPC_MFPH_PC14MFP_QSPI0_CLK},
    {PD_2, SPI_0, SYS_GPD_MFPL_PD2MFP_SPI0_CLK},
    {PD_5, SPI_1, SYS_GPD_MFPL_PD5MFP_SPI1_CLK},
    {PE_4, SPI_3, SYS_GPE_MFPL_PE4MFP_SPI3_CLK},
    {PE_8, SPI_2, (int) SYS_GPE_MFPH_PE8MFP_SPI2_CLK},
    {PF_2, SPI_4, SYS_GPF_MFPL_PF2MFP_QSPI0_CLK},
    {PF_8, SPI_0, (int) SYS_GPF_MFPH_PF8MFP_SPI0_CLK},
    {PG_3, SPI_2, SYS_GPG_MFPL_PG3MFP_SPI2_CLK},
    {PG_6, SPI_3, SYS_GPG_MFPL_PG6MFP_SPI3_CLK},
    {PG_12, SPI_5, (int) SYS_GPG_MFPH_PG12MFP_QSPI1_CLK},
    {PH_6, SPI_1, SYS_GPH_MFPL_PH6MFP_SPI1_CLK},
    {PH_8, SPI_4, (int) SYS_GPH_MFPH_PH8MFP_QSPI0_CLK},
    {NU_PINNAME_BIND(PH_8, SPI_4), SPI_4, SYS_GPH_MFPH_PH8MFP_QSPI0_CLK},
    {PH_8, SPI_1, (int) SYS_GPH_MFPH_PH8MFP_SPI1_CLK},
    {NU_PINNAME_BIND(PH_8, SPI_1), SPI_1, SYS_GPH_MFPH_PH8MFP_SPI1_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
    {PA_3, SPI_4, SYS_GPA_MFPL_PA3MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_4), SPI_4, SYS_GPA_MFPL_PA3MFP_QSPI0_SS},
    {PA_3, SPI_0, SYS_GPA_MFPL_PA3MFP_SPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_0), SPI_0, SYS_GPA_MFPL_PA3MFP_SPI0_SS},
    {PA_6, SPI_1, SYS_GPA_MFPL_PA6MFP_SPI1_SS},
    {PA_11, SPI_2, (int) SYS_GPA_MFPH_PA11MFP_SPI2_SS},
    {PA_12, SPI_2, (int) SYS_GPA_MFPH_PA12MFP_SPI2_SS},
    {PB_2, SPI_1, SYS_GPB_MFPL_PB2MFP_SPI1_SS},
    {PB_10, SPI_3, (int) SYS_GPB_MFPH_PB10MFP_SPI3_SS},
    {PB_15, SPI_0, (int) SYS_GPB_MFPH_PB15MFP_SPI0_SS},
    {PC_0, SPI_1, SYS_GPC_MFPL_PC0MFP_SPI1_SS},
    {PC_3, SPI_4, SYS_GPC_MFPL_PC3MFP_QSPI0_SS},
    {PC_5, SPI_5, SYS_GPC_MFPL_PC5MFP_QSPI1_SS},
    {PC_9, SPI_3, (int) SYS_GPC_MFPH_PC9MFP_SPI3_SS},
    {PD_3, SPI_0, SYS_GPD_MFPL_PD3MFP_SPI0_SS},
    {PD_4, SPI_1, SYS_GPD_MFPL_PD4MFP_SPI1_SS},
    {PE_5, SPI_3, SYS_GPE_MFPL_PE5MFP_SPI3_SS},
    {PE_11, SPI_2, (int) SYS_GPE_MFPH_PE11MFP_SPI2_SS},
    {PF_9, SPI_0, (int) SYS_GPF_MFPH_PF9MFP_SPI0_SS},
    {PG_2, SPI_2, SYS_GPG_MFPL_PG2MFP_SPI2_SS},
    {PG_5, SPI_3, SYS_GPG_MFPL_PG5MFP_SPI3_SS},
    {PG_11, SPI_5, (int) SYS_GPG_MFPH_PG11MFP_QSPI1_SS},
    {PH_7, SPI_1, SYS_GPH_MFPL_PH7MFP_SPI1_SS},
    {PH_9, SPI_4, (int) SYS_GPH_MFPH_PH9MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PH_9, SPI_4), SPI_4, SYS_GPH_MFPH_PH9MFP_QSPI0_SS},
    {PH_9, SPI_1, (int) SYS_GPH_MFPH_PH9MFP_SPI1_SS},
    {NU_PINNAME_BIND(PH_9, SPI_1), SPI_1, SYS_GPH_MFPH_PH9MFP_SPI1_SS},

    {NC,    NC,    0}
};

//*** SD ***

const PinMap PinMap_SD_DAT0[] = {
    {PA_0, SD_1, SYS_GPA_MFPL_PA0MFP_SD1_DAT0},
    {PA_8, SD_1, (int) SYS_GPA_MFPH_PA8MFP_SD1_DAT0},
    {PB_2, SD_0, SYS_GPB_MFPL_PB2MFP_SD0_DAT0},
    {PE_2, SD_0, SYS_GPE_MFPL_PE2MFP_SD0_DAT0},
    {PG_12, SD_1, (int) SYS_GPG_MFPH_PG12MFP_SD1_DAT0},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT1[] = {
    {PA_1, SD_1, SYS_GPA_MFPL_PA1MFP_SD1_DAT1},
    {PA_9, SD_1, (int) SYS_GPA_MFPH_PA9MFP_SD1_DAT1},
    {PB_3, SD_0, SYS_GPB_MFPL_PB3MFP_SD0_DAT1},
    {PE_3, SD_0, SYS_GPE_MFPL_PE3MFP_SD0_DAT1},
    {PG_11, SD_1, (int) SYS_GPG_MFPH_PG11MFP_SD1_DAT1},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT2[] = {
    {PA_2, SD_1, SYS_GPA_MFPL_PA2MFP_SD1_DAT2},
    {PA_10, SD_1, (int) SYS_GPA_MFPH_PA10MFP_SD1_DAT2},
    {PB_4, SD_0, SYS_GPB_MFPL_PB4MFP_SD0_DAT2},
    {PE_4, SD_0, SYS_GPE_MFPL_PE4MFP_SD0_DAT2},
    {PG_10, SD_1, (int) SYS_GPG_MFPH_PG10MFP_SD1_DAT2},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT3[] = {
    {PA_3, SD_1, SYS_GPA_MFPL_PA3MFP_SD1_DAT3},
    {PA_11, SD_1, (int) SYS_GPA_MFPH_PA11MFP_SD1_DAT3},
    {PB_5, SD_0, SYS_GPB_MFPL_PB5MFP_SD0_DAT3},
    {PE_5, SD_0, SYS_GPE_MFPL_PE5MFP_SD0_DAT3},
    {PG_9, SD_1, (int) SYS_GPG_MFPH_PG9MFP_SD1_DAT3},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CMD[] = {
    {PA_5, SD_1, SYS_GPA_MFPL_PA5MFP_SD1_CMD},
    {PB_0, SD_0, SYS_GPB_MFPL_PB0MFP_SD0_CMD},
    {PB_7, SD_1, SYS_GPB_MFPL_PB7MFP_SD1_CMD},
    {PE_7, SD_0, SYS_GPE_MFPL_PE7MFP_SD0_CMD},
    {PG_13, SD_1, (int) SYS_GPG_MFPH_PG13MFP_SD1_CMD},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CLK[] = {
    {PA_4, SD_1, SYS_GPA_MFPL_PA4MFP_SD1_CLK},
    {PB_1, SD_0, SYS_GPB_MFPL_PB1MFP_SD0_CLK},
    {PB_6, SD_1, SYS_GPB_MFPL_PB6MFP_SD1_CLK},
    {PE_6, SD_0, SYS_GPE_MFPL_PE6MFP_SD0_CLK},
    {PG_14, SD_1, (int) SYS_GPG_MFPH_PG14MFP_SD1_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CD[] = {
    {PA_6, SD_1, SYS_GPA_MFPL_PA6MFP_SD1_nCD},
    {PB_12, SD_0, (int) SYS_GPB_MFPH_PB12MFP_SD0_nCD},
    {PD_13, SD_0, (int) SYS_GPD_MFPH_PD13MFP_SD0_nCD},
    {PE_14, SD_1, (int) SYS_GPE_MFPH_PE14MFP_SD1_nCD},
    {PG_15, SD_1, (int) SYS_GPG_MFPH_PG15MFP_SD1_nCD},

    {NC,    NC,    0}
};

//*** CAN ***

const PinMap PinMap_CAN_TD[] = {
    {PA_5, CAN_0, SYS_GPA_MFPL_PA5MFP_CAN0_TXD},
    {PA_12, CAN_0, (int) SYS_GPA_MFPH_PA12MFP_CAN0_TXD},
    {PB_7, CAN_1, SYS_GPB_MFPL_PB7MFP_CAN1_TXD},
    {PB_9, CAN_2, (int) SYS_GPB_MFPH_PB9MFP_CAN2_TXD},
    {PB_11, CAN_0, (int) SYS_GPB_MFPH_PB11MFP_CAN0_TXD},
    {PC_1, CAN_2, SYS_GPC_MFPL_PC1MFP_CAN2_TXD},
    {PC_3, CAN_1, SYS_GPC_MFPL_PC3MFP_CAN1_TXD},
    {PC_5, CAN_0, SYS_GPC_MFPL_PC5MFP_CAN0_TXD},
    {PC_10, CAN_1, (int) SYS_GPC_MFPH_PC10MFP_CAN1_TXD},
    {PC_13, CAN_1, (int) SYS_GPC_MFPH_PC13MFP_CAN1_TXD},
    {PD_9, CAN_2, (int) SYS_GPD_MFPH_PD9MFP_CAN2_TXD},
    {PD_11, CAN_0, (int) SYS_GPD_MFPH_PD11MFP_CAN0_TXD},
    {PE_7, CAN_1, SYS_GPE_MFPL_PE7MFP_CAN1_TXD},
    {PE_14, CAN_0, (int) SYS_GPE_MFPH_PE14MFP_CAN0_TXD},
    {PF_7, CAN_2, SYS_GPF_MFPL_PF7MFP_CAN2_TXD},
    {PF_9, CAN_1, (int) SYS_GPF_MFPH_PF9MFP_CAN1_TXD},
    {PG_0, CAN_1, SYS_GPG_MFPL_PG0MFP_CAN1_TXD},

    {NC,    NC,     0}
};

const PinMap PinMap_CAN_RD[] = {
    {PA_4, CAN_0, SYS_GPA_MFPL_PA4MFP_CAN0_RXD},
    {PA_13, CAN_0, (int) SYS_GPA_MFPH_PA13MFP_CAN0_RXD},
    {PB_6, CAN_1, SYS_GPB_MFPL_PB6MFP_CAN1_RXD},
    {PB_8, CAN_2, (int) SYS_GPB_MFPH_PB8MFP_CAN2_RXD},
    {PB_10, CAN_0, (int) SYS_GPB_MFPH_PB10MFP_CAN0_RXD},
    {PC_0, CAN_2, SYS_GPC_MFPL_PC0MFP_CAN2_RXD},
    {PC_2, CAN_1, SYS_GPC_MFPL_PC2MFP_CAN1_RXD},
    {PC_4, CAN_0, SYS_GPC_MFPL_PC4MFP_CAN0_RXD},
    {PC_9, CAN_1, (int) SYS_GPC_MFPH_PC9MFP_CAN1_RXD},
    {PD_8, CAN_2, (int) SYS_GPD_MFPH_PD8MFP_CAN2_RXD},
    {PD_10, CAN_0, (int) SYS_GPD_MFPH_PD10MFP_CAN0_RXD},
    {PD_12, CAN_1, (int) SYS_GPD_MFPH_PD12MFP_CAN1_RXD},
    {PE_6, CAN_1, SYS_GPE_MFPL_PE6MFP_CAN1_RXD},
    {PE_15, CAN_0, (int) SYS_GPE_MFPH_PE15MFP_CAN0_RXD},
    {PF_6, CAN_2, SYS_GPF_MFPL_PF6MFP_CAN2_RXD},
    {PF_8, CAN_1, (int) SYS_GPF_MFPH_PF8MFP_CAN1_RXD},
    {PG_1, CAN_1, SYS_GPG_MFPL_PG1MFP_CAN1_RXD},

    {NC,    NC,    0}
};
